Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: Message from the reviewer:
ha: Saƙo daga mai nazari:

source: Message is empty
ha: Saƙo babu komai

source: Message is too long
ha: Saƙo ya cika tsawo

source: Message Preview:
ha: Misalin Saƙo:

source: Messages
ha: Saƙwanni

source: Messages didn't add up. Try again.
ha: Ba'a tattara saƙwanni ba. Sake gwadawa.

source: Metrics
ha: Lambobi

source: Minor details that don't affect the instructions
ha: Bayani taƙaitacce wanda bai shafi dokoki ba

source: mobile
ha: wayar hannu

source: Mobile device
ha: Na'urar Wayar hannu

source: Mobile OS for smartphones
ha: Wayar hannu ta OS domin manyan wayoyi

source: Model not allowed.
ha: Ba'a amince da yanayi ba.

source: Moderate Forum Content
ha: Madaidaicin Abin ciki na Dandali

source: Moderate Twitter Accounts
ha: Madaidaicin Asusun Twitter

source: moderator
ha: alƙali

source: Moderator
ha: Alƙali

source: Modified:
ha: Gyararre:

source: Modified by {name} on {datetime}
ha: Gyarawa daga {name} ranar {datetime}

source: Modified {datetime} by {name}
ha: An gyara {datetime} daga {name}

source: Modified Preferences
ha: Zaɓi Waɗanda aka Gyara

source: Month beginning %(year)s-%(month)s-%(date)s
ha: Farkon wata %(year)s-%(month)s-%(date)s

source: Monthly
ha: Wata-wata

source: Monthly Active Contributors
ha: Fitattun Masu Bayar da Gudun mawa na wata-wata

source: More system details
ha: Ƙarin cikakken bayani na na'ura

source: More than
ha: Fiye da

source: More than one level 2 review change drops the localization to 0%
ha: Canja nazari mai mataki fiye da 2 na faɗo da fassara zuwa 0%

source: Most Recent
ha: Na kwana-kwanan nan

source: Most Viewed
ha: Waɗan da aka fi Nazarta

source: Most Visited
ha: Waɗanda aka fi Ziyarta

source: Mozilla Persona
ha: Abubuwan ƙashin kai na Mozilla

source: Mozilla Support
ha: Tallafin Mozilla

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe.
ha: Tallafin Mozilla ƙungiya ce ta zaƙaƙuran 'yan sa-kai da ma'aikata waɗanda ke ƙoƙarin tallafawa masu amfaninmu a duk faɗin duniya.

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe. Join us for an incredible adventure!
ha: Tallafin Mozilla al'umma ce ta 'yan sa-kai masu himma da kuma ma'aikata domin tallafawa masu amfaninmu a duk faɗin duniya. Shigo cikinmu domin ran-gadi mai ban mamaki!

source: Mozilla support is fully powered by our volunteer community that is helping hundreds of users everyday. This community is formed by passionate Firefox and Thunderbird users who take some of their spare time to help others. We couldn't do it without your passion and enthusiasm. Your contribution, as minor as it might seem, has tremendous value. Solving one issue in the support forums can help up to 1000 users a day!
ha: Tallafin Mozilla na da ƙarfafawa daga ƙungiyar jama'armu ta 'yan-sa-kai wadda ke tallafawa ɗaruruwan masu amfani a kullum. Wannan ƙungiyar jama'a ta masu tausayawa masu amfani da Firefox da Mozilla waɗanda suka bayar da lokacinsu domin taimakawa wasu suka kafata. Ba za mu iya ba idan babu ƙauna da sha'awa da ku ke mana. Gudun mawarku, komai kallon ƙanƙantar da ake yi mata, na da matuƙar ƙima. Warware matsala ɗaya a dandalin tallafawa na iya taimakawa masu amfani 1000 a rana!

source: Mozillians
ha: 'Yan Mozilla

source: Mozillians Username
ha: Sunan Mai Amfani na Mozilla

source: Multiple Products
ha: Kayayyaki Masu Yawa

source: Music, Photos and Video
ha: Kiɗa, Hotuna da Bidiyo

source: My contributions
ha: Gudun mawata

source: My password isn't working.
ha: Kalmar wucewata ba ta aiki.

source: My profile
ha: Tarihina

source: My Questions
ha: Tambayoyina

source: Navigation
ha: Gewayawa

source: Need Changes
ha: Akwai bukatar Canje-canje

source: needs attention
ha: na bukatar kulawa

source: Needs change
ha: Ya na bukatar canji

source: Needs change:
ha: Yana bukatar canji:

source: Needs info
ha: Yana bukatar bayani

source: Needs more information
ha: Bukatar ƙarin bayani

source: Needs Update
ha: Yana bukatar Sabuntawa

source: Network Error.
ha: Kuskuren Haɗin Yanar gizo.

source: New announcement for {group}
ha: Sabuwar sanarwa domin {group}

source: New answers for question: %s
ha: Babu amsoshi ga tambayoyi: %s

source: New Article
ha: Sabuwar Maƙala

source: Newer
ha: Mafi sabunta

source: New Message
ha: Sabon saƙo

source: New password
ha: Sabuwar kalmar wucewa

source: New password:
ha: Sabuwar kalmar wucewa:

source: New Password
ha: Sabuwar Kalmar Wucewa

source: New Password Again
ha: Sabuwar Kalmar Wucewa Kuma

source: News &amp; Resources
ha: Labarai &amp; Hanyoyi

source: News Feeds (RSS), Blogs and Social
ha: Wurin samun Labarai (RSS), Blogs da Zamantakewa

source: New thread: {title}
ha: Sabuwar tattaunawa: {title}

source: next
ha: na gaba

source: No differences found
ha: Ba'a sami bambance-bambance ba

source: No, ignore
ha: A'a, yi watsi

source: No, I'm not.
ha: A'a, ban yi ba.

source: No media files found.
ha: Ba'a sami fayil na kaɗe-kaɗe ba.

source: No messages selected. Please try again.
ha: Ba'a zaɓi saƙwanni ba. Sake jarrabawa.

source: None
ha: Babu

source: None of these solve my problem
ha: Babu daga cikin waɗan nan da ta warware matsalata

source: No one has helped translate this article yet. If you already know how localizing for SUMO works, <a href="%(document_trans_link)s">start translating now</a>. If you want to learn how to translate articles for SUMO, <a href="%(help_link)s">please start here</a>.
ha: Ba wanda ya taimaka aka fassara wannan maƙala tukuna. Idan ka riga ka san yadda fassara domin SUMO ta ke aiki, <a href="%(document_trans_link)s">fara fassara yanzu</a>. Idan ka na son ka koyi ta yaya za ka yi fassara maƙaloli domin SUMO, <a href="%(help_link)s">fara daga nan</a>.

source: No other documents link to {title}.
ha: Babu wasu daftarori da su ke da haɗi zuwa {title}.

source: No pages matched the search criteria
ha: Babu shafin da ya dace da ƙa'idar bincike

source: No related documents.
ha: Babu daftarori masu alaƙa.

source: No replies
ha: Babu amsoshi

source: No sections found
ha: Ba'a gano ɓangarori ba

source: No Surprises
ha: Babu Bayar da Mamaki

source: No tags entered.
ha: Ba'a shigar da shaida ba.

source: Note: Searching for "tag1, tag2" returns questions tagged with both tag1 and tag2
ha: Bayani: Nema na "tag 1, tag2" zai mayar da tambaya mai alama tare da tag1 da tag2

source: Note: There are no approved translations for this article.
ha: Lura: Babu fassara da aka amince da ita domin wannan maƙala.

source: Note: This article has no revisions ready for localization.
ha: Lura: Wannan maƙala ba ta da nazari da aka shirya domin fassara.

source: Not Helpful
ha: Babu Taimako

source: Notify me of any future changes to this page
ha: Sanar da ni duk wasu gyare-gyare na gaba a wannan shafin

source: Not responded in 24 hours
ha: Ba'a bayar da amsa ba a awanni 24

source: Not responded in 72 hours
ha: Ba'a bayar da amsa ba a awanni 72

source: Not sure how often
ha: Bani da tabbas ko sau nawa

source: No users selected!
ha: Ba'a zaɓi masu amfani ba!

source: No users were found for your search query.
ha: Ba'a sami masu amfani ba domin nema na bincikenka.

source: No votes data
ha: Babu bayanin ƙuri'a

source: Now you can combine both and help Firefox users on Twitter. It's quick, it's easy, and you don't have to be a tech superstar to do it. We call it our Army of Awesome.
ha: Yanzu za ka iya haɗa biyun kuma ka taimakawa masu amfani da Firefox a Twitter. Yana da sauri, sauƙi, kuma ba sai ka zama ƙwararren injiniya ba domin yinsa. Muna kiransa Rundunarmu ta Burgewa.

source: {num} answers
ha: amsoshi {num}

source: %(number)d day ago
ha: %(number)d kwanakin da su ka gabata

source: %(number)d hour ago
ha: %(number)d awannin da su ka gabata

source: %(number)d minute ago
ha: %(number)d mintin da ya gabata

source: %(number)d month ago
ha: %(number)d watannin da su ka gabata

source: %(number)d second ago
ha: %(number)d daƙiƙoƙin da su ka gabata

source: %(number)d week ago
ha: %(number)d makon da ya gabata

source: %(number)d year ago
ha: %(number)d shekara da ta gabata

source: Numbered List
ha: Jeri mai Lamba

source: Numbered list item
ha: Jerin kaya masu lamba

source: Number of active Army of Awesome contributors
ha: Adadin masu bayar da gudun mawa masu aiki na Rundunar Burgewa

source: Number of active contributors to the English KB
ha: Adadin masu bayar da gudun mawa ga KB na Turanci

source: Number of active contributors to the non-English KB
ha: Adadin masu bayar da gudun mawa masu aiki zuwa ga KB wanda ba na Turanci ba

source: Number of active forum contributors
ha: Adadin dandali masu aiki masu bayar da gudun mawa

source: Number of answers
ha: Lambar tambayoyi

source: Number of Answers
ha: Lambar Amsoshi

source: Number of replies
ha: Adadin amsoshi

source: Number of Replies
ha: Yawan Amsoshi

source: Number of votes. Must be an integer.
ha: Adadin ƙuriƙu. Dole ta zama cikakkiyar lamba.

source: %(numerator)s of %(denominator)s
ha: %(numerator)s na %(denominator)s

source: %(numerator)s <small>of %(denominator)s</small>
ha: %(numerator)s <small>na %(denominator)s</small>

source: {num} solutions
ha: mafita {num}

source: %(num)s <small>of %(total)s</small>
ha: %(num)s <small>na %(total)s</small>

source: {num_views} views
ha: {num_views} ra'ayuyyuka

source: Object does not exist.
ha: Babu kayan.

source: Obsolete:
ha: Tsoho:

source: Official blog
ha: Blog na hukuma

source: Oh, no! It looks like an unexpected error occurred. We've already notified the site administrators. Please try again now, or in a few minutes.
ha: Ayya! Bisa ga dukkan alamu wani kuskure ya afku. Tuni mun sanar da masu gudanar da dandalin yanar gizonmu. Sake jarrabawa yanzu, ko nan da wasu mintina.

source: Oh, no! Looks like there are no posts!
ha: Ayya! Bisa ga dukkan alamu babu aike-aike!

source: Older
ha: Mafi tsufa

source: Old Password
ha: Tsohuwar kalmar wucewa

source: %(old)s-redirect-%(number)i
ha: %(old)s turawa-%(number)i

source: %(old)s Redirect %(number)i
ha: %(old)s Turawa %(number)i

source: Once you’ve clicked on the link, you can throw away this email.
ha: Da zaran ka danna haɗin, za ka jefar da wannan imel.

source: Only displayed on search results page
ha: An nuna kawai a shafin sakamakon nema

source: Only use and share information about our users for their benefit and as disclosed in our notices.
ha: Kawai yi amfani kuma ka raba bayani dangane da masu amfaninmu domin amfaninsu da kuma kamar yadda muka bayyana a sanarwarmu.

source: Oops, there was an error.
ha: Kash, akwai kuskure.

source: Oops, your request was unsuccessful
ha: Kash, nemanka bai sami nasara ba

source: Open Badges
ha: Buɗe Bajoji

source: Open <em>Help &gt; Troubleshooting Information</em>.
ha: Buɗe <em>Taimako &gt; Bayanin Warware Matsala</em>.

source: Operating system
ha: Tsarin gudanarwa

source: Original post date
ha: Kwanan watan aike na asali

source: Other Mozilla products
ha: Sauran kayayyakin Mozilla

source: Other (please specify)
ha: Saura (yi bayani dalla-dalla)

source: Other products
ha: Sauran kayayyaki

source: Other questions with Firefox for Windows 8 Touch.
ha: Sauran tambayoyi tare da Firefox domin Windows 8 Touch.

source: Other reason:
ha: Sauran dalili:

source: Other ways to get involved
ha: Wasu hanyoyin da za ka shiga

source: Our contributors have been working hard on articles and it would be great if you could review them. The faster we get them published the faster they start helping users.
ha: Masu bayar da gudun mawarmu su na aiki tuƙuru a kan rubuce-rubece kuma zai zama abu mahimmi idan za ka yi nazarinsu. Idan an bugasu cikin gaggawa za su fara taimakawa masu amfani.

source: Our volunteers are working on translating this article. Until it's ready, maybe the English version can be of some help.
ha: 'Yan sa-kai namu su na aiki domin fassara wannan maƙala. Har sai an gama, mai yiwuwa na Turanci ya taimaka maka.

source: Overall
ha: Gaba ɗaya

source: Overview
ha: Taƙaitaccen bayani

source: owner
ha: mai mallaka

source: Page {0} of {1}.
ha: Shafi {0} daga {1}.

source: Page does not exist.
ha: Babu shafi.

source: Page {n}
ha: Shafi {n}

source: Page Not Found
ha: Ba'a Sami Shafi ba

source: Password
ha: Kalmar wucewa

source: Password:
ha: Kalmar wucewa:

source: Password change successful!
ha: An sami nasarar canja kalmar wucewa!

source: Password is required.
ha: Ana bukatar Kalmar wucewa.

source: Password must be 8 or more characters.
ha: Kalmar wucewa dole ta zama haruffa 8 ko fiye.

source: Password reset
ha: An sake saita kalmar wucewa

source: Password Reset
ha: An sake saita Kalmar wucewa

source: Password reset on {sitename}
ha: An sake saita kalmar wucewa a {sitename}

source: Password reset unsuccessful
ha: Ba'a sami nasarar sake saita kalmar wucewa ba

source: Passwords, forms and search
ha: Kalamar wucewa, fom da nema

source: Passwords, forms, search, and history - control what Firefox suggests
ha: Kalmar wucewa, fom, nema da tarihi - sarrafa shawarwarin Firefox

source: Password should be at least 8 characters long and contain at least 1 number.
ha: Kalmar wucewa za ta zama a ƙalla tsawon haruffa 8 kuma ta ƙunshi a ƙalla lamba 1.

source: Password successfully reset.
ha: An sami nasarar sake saita kalmar wucewa.

source: Paste the info in the text box below.
ha: Liƙa bayanin a akwatin rubutu ta ƙasa.

source: Payment Issues
ha: Batutuwan Biya

source: Payments
ha: Biya

source: Payments/Settlement
ha: Biya/Biya

source: Pending
ha: Wanda ba'a gama ba

source: Percent
ha: Bisa ɗari

source: Percent Localized: All
ha: Kaso daga cikin ɗari da aka fassara: Duka

source: Percent Localized: Top 100
ha: Kaso daga ɗari wanda aka Fassara: Fitattu 100

source: Percent Localized: Top 20
ha: Kaso daga cikin ɗari da aka fassara: Fitattu 20

source: Percent Yes
ha: Kaso daga ɗari E

source: Pick a product
ha: Ɗauki kaya

source: Pick a topic and try some solutions
ha: Ɗauki batu kuma ka jarraba mafita

source: Pick a way to get involved
ha: Zaɓi hanya da za ka shiga

source: Please ask a new question if you need help.
ha: Yi sabuwar tambaya idan ka na bukatar taimako.

source: Please check you are logged in, and try again.
ha: Duba cewa ka shiga, sannan ka sake jarrabawa.

source: Please choose a category.
ha: Zaɓi jinsi.

source: Please complete the form below to submit your question to our Marketplace Support group.
ha: Cike fom na ƙasa domin aikawa da tambayarka zuwa Ƙungiyar Tallafin Marketplace.

source: Please confirm your email address
ha: Tabbatar da adireshinka na imel

source: Please confirm your email address.
ha: Tabbatar da adireshinka na imel.

source: Please Confirm Your Email Address
ha: Tabbatar da Adireshinka na Imel

source: Please confirm your Firefox Help question
ha: Tabbatar da tambayarka ta Taimakon Firefox

source: Please describe your issue in the body.
ha: Kwatanta batunka a jiki.

source: Please enter a correct username and password. Note that both fields are case-sensitive.
ha: Shigar da sunan mai amfani da kalmar wucewa dai dai. Ka lura da inda ka yi amfani da manya ko ƙananan baƙaƙe.

source: Please enter a facebook.com URL.
ha: Shigar da URL na facebokk.com.

source: Please enter your password twice.
ha: Shigar da kalmar wucewarka sau biyu.

source: Please keep the length of the body content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon jiki na abin da ke ciki zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of the comment to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon sharhinka zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya na haruffa %(show_value)s.

source: Please keep the length of the content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon abin da ke ciki zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya na haruffa %(show_value)s.

source: Please keep the length of the slug to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ajiye tsawon tsarin ya zama zuwa haruffa %(limit_value)s ko ƙasa. A yanzu yana haruffa %(show_value)s.

source: Please keep the length of the subject to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon batu ya zama haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of the summary to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon taƙaitaccen bayani zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of the title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ajiye tsawon takenka zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya na haruffa %(show_value)s.

source: Please keep the length of your content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Mayar da tsawon abin ciki na ka zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of your description to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon abin kwatantawarka zuwa %(limit_value)s haruffa ko ƙasa. A yanzu ya kai %(show_value)s haruffa.

source: Please keep the length of your image filename to %(max)s characters or less. It is currently %(length)s characters.
ha: Ka bar tsawon sunan fayil ɗin hotonka zuwa %(max)s haruffa ko ƙasa. A yanzu kai %(length)s haruffa.

source: Please keep the length of your message to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon saƙonka zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of your question to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Mayar da tsawon tambayarka zuwa haruffa %(limit_value)s ko ƙasa. A yanzu ya kai haruffa %(show_value)s.

source: Please keep the length of your title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ha: Ka bar tsawon taken maƙalarka zuwa %(limit_value)s haruffa ko ƙasa. A yanzu %(show_value)s haruffa.

source: Please note that these selections are specific to the current product selected.
ha: Ka lura cewa waɗanda aka zaɓa na musamman ne zuwa kayayyakin da aka zaɓa na yanzu.

source: Please note that you will be subscribed to these notifications for all products. If you are only interested in specific products, please go to the dashboard for that product.
ha: Ka lura cewa za'a sa ka yi sautu zuwa waɗannan sanarwa domin duk kayayyaki. Idan kana da sha'awa a wani kaya na musamman, jeka allon wannan kaya.

source: Please provide a description.
ha: Bayar da kwatance.

source: Please provide a message.
ha: Bayar da saƙo.

source: Please provide an email.
ha: Bayar da imel.

source: Please provide an email address and we'll send you an alert.
ha: Bayar da adiresin imel kuma zamu aiko maka da faɗakarwa.

source: Please provide a question.
ha: Bayar da tambaya.

source: Please provide a slug.
ha: Bayar da tsari.

source: Please provide a subject.
ha: Bayar da batu.

source: Please provide a summary.
ha: Bayar da taƙaitaccen bayani.

source: Please provide a tag.
ha: Bayar da shaida.

source: Please provide a title.
ha: Bayar da take.

source: Please provide content.
ha: Bayar da abin ciki.

source: Please provide more details
ha: Bayar da cikakken bayani

source: Please provide the Transaction ID.
ha: Bayar da Lambar Hulɗa.

source: Please review the latest revision.
ha: Bayar da Lambar Hulɗa.

source: Please review the latest version.
ha: Bayar da Lambar Hulɗa.

source: Please select...
ha: Zaɓi...

source: Please select a category from the previous column or start a search.
ha: Zaɓi jinsi daga shafin da ya gabata ko ka sake sabon nema.

source: Please select a different title.
ha: Zaɓi wani take daban.

source: Please select an image or video to insert.
ha: Zaɓi hoto ko bidiyo domin sakawa.

source: Please select at least one product.
ha: Zaɓi a kalla kaya ɗaya.

source: Please select at least one topic.
ha: Zaɗi a ƙalla batu ɗaya.

source: Please type in your username to confirm
ha: Rubuta sunanka na mai amfani domin tabbatarwa

source: Please upload an image with one of the following extensions: jpg, jpeg, png, gif.
ha: Loda hoto tare da ɗaya daga cikin waɗan nan ƙari: jpg, jpeg, png, gip.

source: Please visit the <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Paypal Help Center</a>.
ha: Ziyarci <a href="https://www.paypal.com/cgi-bin/helpweb?cmd=_help"> Cibiyar Taimako ta Paypal </a>.

source: Please visit the Marketplace page for the application. There you can find the developers' contact information and contact them directly.
ha: Ziyarci shafin Marketplace domin nema. A can za ka sami bayanin masu samarwa kuma ka tuntuɓesu kai tsaye.

source: Please wait...
ha: Dakata...

source: Popcorn Maker
ha: Mai yin Popcorn

source: Portions of this content are &copy;1998–2015 <br>by individual mozilla.org contributors. Content <br>available under a <a href="//www.mozilla.org/foundation/licensing/website-content.html">Creative Commons license</a>.
ha: Ɓangare na wannan abin ciki kwafi ne na;1998–2015 <br>daga ɗaiɗaikun masu bayar da gudun mawa ga mozilla.org. Abin ciki <br>an samu a ƙarƙashin <a href="//www.mozilla.org/foundation/licensing/website-content.html">Creative Commons license</a>.

source: post
ha: Aike

source: Post a new thread
ha: Aika da sabuwar tattaunawa

source: Post a question
ha: Aika tambaya

source: Post a reply
ha: Aika amsa

source: Post a Reply
ha: Aika Amsa

source: Post contains
ha: Aike ya ƙunshi

source: Posted
ha: An aika

source: posted by
ha: aikawa daga

source: Post Preview:
ha: Aika Misali:

source: Post Question
ha: Aika Tambaya

source: Post Reply
ha: Aika amsa

source: Posts from everyone
ha: Aike-aike daga kowa

source: Post Thread
ha: Aika Tattaunawa

source: Preferred language
ha: Yaren da aka fi so

source: Preview
ha: Misali

source: Preview Changes
ha: Misalin Canje-canje

source: Preview Content
ha: Misalin Abin ciki

source: Preview Reply
ha: Kalli Misalin Amsa

source: previous
ha: Wanda ya gabata

source: Previous
ha: Wanda ya gabata

source: Privacy and security
ha: Na ƙashin kai da tsaro

source: Privacy and Security
ha: Sirri da Tsaro

source: Privacy and security settings
ha: Saitunan ƙashin kai da tsaro

source: Private message
ha: Saƙo na ƙashin kai

source: Private Message
ha: Saƙo na Ƙashin kai

source: Problems with add-ons, plugins or unwanted software
ha: Matsala da abubuwa daɗi, haɗi ko hanyoyin tafiyar da kwamfuta wanda ba'a so

source: Problems with websites
ha: Matsala tare da dandalin yanar gizo

source: Problems with websites that don't work well in Firefox for Windows 8 Touch.
ha: Matsala tare da dandalin yanar gizo wanda ba ya aiki sosai a Firefox domin Window 8 Touch.

source: Procedures to diagnose and fix problems
ha: Matakai domin magani da gyara matsaloli

source: Product
ha: Kaya

source: {product} Help
ha: {product} Taimako

source: [{product}] Knowledge Base Dashboard
ha: [{product}] Allon Tushen Ilimi

source: Products
ha: Kayayyaki

source: {product} Support Forum
ha: {product} Dandalin Tallafi

source: Protect your information with Firefox's privacy settings on iOS
ha: Kare bayananka tare da saitunan sirri na Firefox a kan iOS

source: Protect your privacy
ha: Kare sirrinka

source: Provide a brief description of this media.
ha: Bayar da taƙaitaccen bayani na wannan waƙa.

source: Provide more details
ha: Bayar da ƙarin bayani
